src/cf/Documents/КП_Приказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>КП_Приказ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УтвердитьПриказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Утвердил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КП_СтатусыПриказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/КП_СтатусыПриказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>КП_СтатусыПриказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утверждён</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонён</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/КП_Приказ/Ext/ObjectModule.bsl
&НаСервере
Процедура ОбновитьСтатусДокумента() Экспорт
	
	Если ПометкаУдаления Тогда
		
		 ЭтотОбъект.Статус = Перечисления.КП_СтатусыПриказа.Отклонён;
	
	ИначеЕсли ЭтотОбъект.УтвердитьПриказ Тогда
		
		ЭтотОбъект.Статус = Перечисления.КП_СтатусыПриказа.Утверждён;
		
	Иначе      
		
		ЭтотОбъект.Статус = Перечисления.КП_СтатусыПриказа.Проект;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьСтатус()    
		
	КП_РаботаСRabbitMQКлиентСервер.ОтправитьСообщение(Строка(ЭтотОбъект.Статус));
		
КонецПроцедуры  

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
			
	Если ЭтотОбъект.УтвердитьПриказ Тогда
		
			ОтправитьСтатус(); 	
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
			
	ОбновитьСтатусДокумента();	
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция СформироватьJSON()
	
	Данные = Новый Структура;
	Данные.Вставить("user", ЭтотОбъект.Ответственный);
	Данные.Вставить("status", ЭтотОбъект.Статус);
	Данные.Вставить("number", ЭтотОбъект.Номер);
	
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	
	
КонецФункции
